//#################################################
//#               孤狼jQuery系列			
//#						
//#               *** 孤    狼 ***		
//#	QQ:312284609				
//#	E-mail:wanyanjiabin@126.com		
//#						
//#################################################
var s = ["s1", "s2", "s3"];
var opt0 = ["省份", "地级市", "县级市、县"];
function city(){
    for(i = 0; i < s.length - 1; i++){
        //        document.getElementById(s[i]).onchange = new Function("change(" + (i + 1) + ")");
        document.getElementById(s[i]).index = i;
        document.getElementById(s[i]).onchange = function(){
            change(this.index + 1);
        };
    }
    change(0);
}
function Dsy(){
    this.Items = {};
}
Dsy.prototype.add = function(id, iArray){
    this.Items[id] = iArray;
}
Dsy.prototype.Exists = function(id){
    if(typeof(this.Items[id]) == "undefined") return false;
    return true;
}
function change(v){
    var str = "0";
    for(i = 0; i < v; i++){
        str += ("_" + (document.getElementById(s[i]).selectedIndex - 1));
    }
    var ss = document.getElementById(s[v]);
    /*
    with(ss){
        length = 0;
        options[0] = new Option(opt0[v], opt0[v]);
        if(v && document.getElementById(s[v - 1]).selectedIndex > 0 || !v){
            if(dsy.Exists(str)){
                ar = dsy.Items[str];
                for(i = 0; i < ar.length; i++) options[length] = new Option(ar[i], ar[i]);
                if(v) options[1].selected = true;
            }
        }
        if(++v < s.length){
            change(v);
        }
    }
    */
    ss.length = 0;
    ss.options = [];
    ss.options[0] = new Option(opt0[v], opt0[v]);
    if(v && document.getElementById(s[v - 1]).selectedIndex > 0 || !v){
        if(dsy.Exists(str)){
            ss.ar = dsy.Items[str];
            for(i = 0; i < ss.ar.length; i++) ss.options[ss.length] = new Option(ss.ar[i], ss.ar[i]);
            if(v) ss.options[1].selected = true;
        }
    }
    if(++v < s.length){
        change(v);
    }
}
var dsy = new Dsy();

//省级
dsy.add("0", ["北京", "安徽", "福建", "甘肃", "广东", "广西", "贵州", "海南", "河北", "河南", "黑龙江", "湖北", "湖南", "吉林", "江苏", "江西", "辽宁", "内蒙古", "宁夏", "青海", "山东", "山西", "陕西", "上海", "四川", "天津", "西藏", "新疆", "云南", "浙江", "重庆"]);

//北京市
dsy.add("0_0", ["北京"]);
dsy.add("0_0_0", ['朝阳区', '东城区', '丰台区', '大兴区', '宣武区', '崇文区', '平谷区', '怀柔区', '房山区', '昌平区', '海淀区', '石景山区', '西城区', '通州区', '门头沟区', '顺义区']);
//安徽省
dsy.add("0_1", ['亳州市', '六安市', '合肥市', '安庆市', '宣城市', '宿州市', '巢湖市', '池州市', '淮北市', '淮南市', '滁州市', '芜湖市', '蚌埠市', '铜陵市', '阜阳市', '马鞍山市', '黄山市']);
dsy.add("0_1_0", ['利辛县', '市辖区', '涡阳县', '蒙城县']);
dsy.add("0_1_1", ['寿县', '市辖区', '舒城县', '金寨县', '霍山县', '霍邱县']);
dsy.add("0_1_2", ['市辖区', '肥东县', '肥西县', '长丰县']);
dsy.add("0_1_3", ['太湖县', '宿松县', '岳西县', '市辖区', '怀宁县', '望江县', '枞阳县', '桐城市', '潜山县']);
dsy.add("0_1_4", ['宁国市', '市辖区', '广德县', '旌德县', '泾县', '绩溪县', '郎溪县']);
dsy.add("0_1_5", ['市辖区', '泗县', '灵璧县', '砀山县', '萧县']);
dsy.add("0_1_6", ['含山县', '和县', '市辖区', '庐江县', '无为县']);
dsy.add("0_1_7", ['东至县', '市辖区', '石台县', '青阳县']);
dsy.add("0_1_8", ['市辖区', '濉溪县']);
dsy.add("0_1_9", ['凤台县', '市辖区']);
dsy.add("0_1_10", ['全椒县', '凤阳县', '天长市', '定远县', '市辖区', '明光市', '来安县']);
dsy.add("0_1_11", ['南陵县', '市辖区', '繁昌县', '芜湖县']);
dsy.add("0_1_12", ['五河县', '固镇县', '市辖区', '怀远县']);
dsy.add("0_1_13", ['市辖区', '铜陵县']);
dsy.add("0_1_14", ['临泉县', '太和县', '市辖区', '界首市', '阜南县', '颍上县']);
dsy.add("0_1_15", ['市辖区', '当涂县']);
dsy.add("0_1_16", ['休宁县', '市辖区', '歙县', '祁门县', '黟县']);

//福建省
dsy.add("0_2", ['三明市', '南平市', '厦门市', '宁德市', '泉州市', '漳州市', '福州市', '莆田市', '龙岩市']);
dsy.add("0_2_0", ['大田县', '宁化县', '将乐县', '尤溪县', '市辖区', '建宁县', '明溪县', '永安市', '沙县', '泰宁县', '清流县']);
dsy.add("0_2_1", ['光泽县', '市辖区', '建瓯市', '建阳市', '政和县', '松溪县', '武夷山市', '浦城县', '邵武市', '顺昌县']);
dsy.add("0_2_2", ['市辖区']);
dsy.add("0_2_3", ['古田县', '周宁县', '寿宁县', '屏南县', '市辖区', '柘荣县', '福安市', '福鼎市', '霞浦县']);
dsy.add("0_2_4", ['南安市', '安溪县', '市辖区', '德化县', '惠安县', '晋江市', '永春县', '石狮市', '金门县']);
dsy.add("0_2_5", ['东山县', '云霄县', '华安县', '南靖县', '市辖区', '平和县', '漳浦县', '诏安县', '长泰县', '龙海市']);
dsy.add("0_2_6", ['市辖区', '平潭县', '永泰县', '福清市', '罗源县', '连江县', '长乐市', '闽侯县', '闽清县']);
dsy.add("0_2_7", ['仙游县', '市辖区']);
dsy.add("0_2_8", ['上杭县', '市辖区', '武平县', '永定县', '漳平市', '连城县', '长汀县']);

//甘肃
dsy.add("0_3", ['临夏回族自治州', '兰州市', '嘉峪关市', '天水市', '定西市', '平凉市', '庆阳市', '张掖市', '武威市', '甘南藏族自治州', '白银市', '酒泉市', '金昌市', '陇南市']);
dsy.add("0_3_0", ['东乡族自治县', '临夏县', '临夏市', '和政县', '广河县', '康乐县', '永靖县', '积石山保安族东乡族撒拉族自治县']);
dsy.add("0_3_1", ['市辖区', '榆中县', '永登县', '皋兰县']);
dsy.add("0_3_2", ['市辖区']);
dsy.add("0_3_3", ['市辖区', '张家川回族自治县', '武山县', '清水县', '甘谷县', '秦安县']);
dsy.add("0_3_4", ['临洮县', '岷县', '市辖区', '渭源县', '漳县', '通渭县', '陇西县']);
dsy.add("0_3_5", ['华亭县', '崇信县', '市辖区', '庄浪县', '泾川县', '灵台县', '静宁县']);
dsy.add("0_3_6", ['华池县', '合水县', '宁县', '市辖区', '庆城县', '正宁县', '环县', '镇原县']);
dsy.add("0_3_7", ['临泽县', '山丹县', '市辖区', '民乐县', '肃南裕固族自治县', '高台县']);
dsy.add("0_3_8", ['古浪县', '天祝藏族自治县', '市辖区', '民勤县']);
dsy.add("0_3_9", ['临潭县', '卓尼县', '合作市', '夏河县', '玛曲县', '碌曲县', '舟曲县', '迭部县']);
dsy.add("0_3_10", ['会宁县', '市辖区', '景泰县', '靖远县']);
dsy.add("0_3_11", ['市辖区', '敦煌市', '玉门市', '瓜州县', '肃北蒙古族自治县', '金塔县', '阿克塞哈萨克族自治县']);
dsy.add("0_3_12", ['市辖区', '永昌县']);
dsy.add("0_3_13", ['两当县', '宕昌县', '市辖区', '康县', '徽县', '成县', '文县', '礼县', '西和县']);

//广东
dsy.add("0_4", ['广州市', '东莞市', '中山市', '云浮市', '佛山市', '惠州市', '揭阳市', '梅州市', '汕头市', '汕尾市', '江门市', '河源市', '深圳市', '清远市', '湛江市', '潮州市', '珠海市', '肇庆市', '茂名市', '阳江市', '韶关市']);
dsy.add("0_4_0", ['花都区', '番禺区', '黄浦区', '白云区', '越秀区', '天河区', '荔湾区', '芳村区', '萝岗区', '珠海区', '南沙区', '东山区', '从化市', '增城市']);
dsy.add("0_4_1", ['东莞市区内', '长安镇', '虎门镇', '中堂镇', '大岭山镇', '大朗镇', '厚街镇', '凤岗镇', '常平镇', '横沥镇', '东坑镇', '黄江镇', '樟木头镇', '唐厚镇', '道滘镇', '清溪镇', '沙田镇', '高埗镇', '石龙镇', '石排镇', '企石镇', '寮步镇', '洪梅镇', '麻涌镇', '桥头镇', '望牛墩镇', '茶山镇', '谢岗镇', '石碣镇', '松山湖']);
dsy.add("0_4_2", ['中山市区内', '南朗镇', '小榄镇', '古镇', '坦洲镇', '黄圃镇', '三乡镇', '东凤镇', '横栏镇', '三角镇', '南头镇', '民众镇', '沙溪镇', '东升镇', '板芙镇', '神湾镇', '港口镇', '大涌镇', '阜沙镇', '东升镇', '火炬开发区']);
dsy.add("0_4_3", ['罗定市', '云城区', '云安县', '新兴县', '郁南县']);
dsy.add("0_4_4", ['顺德区', '禅城区', '南海区', '三水区', '高明区']);
dsy.add("0_4_5", ['惠阳区', '惠城区', '大亚湾区', '博罗县', '惠东县', '龙门县']);
dsy.add("0_4_6", ['市辖区', '惠来县', '揭东县', '揭西县', '普宁市']);
dsy.add("0_4_7", ['丰顺县', '五华县', '兴宁市', '大埔县', '市辖区', '平远县', '梅县', '蕉岭县']);
dsy.add("0_4_8", ['龙湖区', '金平区', '濠江区', '朝阳区', '潮南区', '澄海区', '南澳县']);
dsy.add("0_4_9", ['市辖区', '海丰县', '陆丰市', '陆河县']);
dsy.add("0_4_10", ['逢江区', '江海区', '新会区', '台山市', '开平市', '恩平市', '鹤山市']);
dsy.add("0_4_11", ['东源县', '和平县', '市辖区', '紫金县', '连平县', '龙川县']);
dsy.add("0_4_12", ['罗湖区', '福田区', '南山区', '龙岗区', '宝安区', '盐田区']);
dsy.add("0_4_13", ['佛冈县', '市辖区', '清新县', '英德市', '连南瑶族自治县', '连山壮族瑶族自治县', '连州市', '阳山县']);
dsy.add("0_4_14", ['赤坎区', '霞山区', '坡头区', '麻章区', '吴川市', '市辖区', '廉江市', '徐闻县', '遂溪县', '雷州市']);
dsy.add("0_4_15", ['市辖区', '潮安县', '饶平县']);
dsy.add("0_4_16", ['香洲区', '斗门区', '金湾区']);
dsy.add("0_4_17", ['四会市', '封开县', '市辖区', '广宁县', '德庆县', '怀集县', '高要市']);
dsy.add("0_4_18", ['信宜市', '化州市', '市辖区', '电白县', '高州市']);
dsy.add("0_4_19", ['市辖区', '阳东县', '阳春市', '阳西县']);
dsy.add("0_4_20", ['武江区', '浈江区', '曲江区', '乐昌市', '乳源瑶族自治县', '仁化县', '南雄市', '始兴县', '新丰县', '翁源县']);

//广西
dsy.add("0_5", ['南宁市', '北海市', '崇左市', '来宾市', '柳州市', '桂林市', '梧州市', '河池市', '玉林市', '百色市', '贵港市', '贺州市', '钦州市', '防城港市']);
dsy.add("0_5_0", ['兴宁区', '青秀区', '江南区', '西乡塘区', '良庆区', '邕宁区', '武鸣县', '隆安县', '马山县', '上林县', '宾阳县', '横县']);
dsy.add("0_5_1", ['海城区', '银海区', '铁山港区', '合浦县']);
dsy.add("0_5_2", ['凭祥市', '大新县', '天等县', '宁明县', '市辖区', '扶绥县', '龙州县']);
dsy.add("0_5_3", ['合山市', '市辖区', '忻城县', '武宣县', '象州县', '金秀瑶族自治县']);
dsy.add("0_5_4", ['三江侗族自治县', '市辖区', '柳城县', '柳江县', '融安县', '融水苗族自治县', '鹿寨县']);
dsy.add("0_5_5", ['临桂县', '全州县', '兴安县', '市辖区', '平乐县', '恭城瑶族自治县', '永福县', '灌阳县', '灵川县', '荔蒲县', '资源县', '阳朔县', '龙胜各族自治县']);
dsy.add("0_5_6", ['岑溪市', '市辖区', '苍梧县', '蒙山县', '藤县']);
dsy.add("0_5_7", ['东兰县', '凤山县', '南丹县', '大化瑶族自治县', '天峨县', '宜州市', '巴马瑶族自治县', '市辖区', '环江毛南族自治县', '罗城仫佬族自治县', '都安瑶族自治县']);
dsy.add("0_5_8", ['兴业县', '北流市', '博白县', '容县', '市辖区', '陆川县']);
dsy.add("0_5_9", ['乐业县', '凌云县', '市辖区', '平果县', '德保县', '田东县', '田林县', '田阳县', '西林县', '那坡县', '隆林各族自治县', '靖西县']);
dsy.add("0_5_10", ['市辖区', '平南县', '桂平市']);
dsy.add("0_5_11", ['富川瑶族自治县', '市辖区', '昭平县', '钟山县']);
dsy.add("0_5_12", ['市辖区', '浦北县', '灵山县']);
dsy.add("0_5_13", ['上思县', '东兴市', '市辖区']);

//"贵州"
dsy.add("0_6", ['六盘水市', '安顺市', '毕节地区', '贵阳市', '遵义市', '铜仁地区', '黔东南苗族侗族自治州', '黔南布依族苗族自治州', '黔西南布依族苗族自治州']);
dsy.add("0_6_0", ['六枝特区', '水城县', '盘县', '钟山区']);
dsy.add("0_6_1", ['关岭布依族苗族自治县', '市辖区', '平坝县', '普定县', '紫云苗族布依族自治县', '镇宁布依族苗族自治县']);
dsy.add("0_6_2", ['大方县', '威宁彝族回族苗族自治县', '毕节市', '纳雍县', '织金县', '赫章县', '金沙县', '黔西县']);
dsy.add("0_6_3", ['修文县', '市辖区', '开阳县', '息烽县', '清镇市']);
dsy.add("0_6_4", ['习水县', '仁怀市', '余庆县', '凤冈县', '务川仡佬族苗族自治县', '市辖区', '桐梓县', '正安县', '湄潭县', '绥阳县', '赤水市', '道真仡佬族苗族自治县', '遵义县']);
dsy.add("0_6_5", ['万山特区', '印江土家族苗族自治县', '德江县', '思南县', '松桃苗族自治县', '江口县', '沿河土家族自治县', '玉屏侗族自治县', '石阡县', '铜仁市']);
dsy.add("0_6_6", ['三穗县', '丹寨县', '从江县', '凯里市', '剑河县', '台江县', '天柱县', '岑巩县', '施秉县', '榕江县', '锦屏县', '镇远县', '雷山县', '麻江县', '黄平县', '黎平县']);
dsy.add("0_6_7", ['三都水族自治县', '平塘县', '惠水县', '独山县', '瓮安县', '福泉市', '罗甸县', '荔波县', '贵定县', '都匀市', '长顺县', '龙里县']);
dsy.add("0_6_8", ['兴义市', '兴仁县', '册亨县', '安龙县', '普安县', '晴隆县', '望谟县', '贞丰县']);

//"海南"
dsy.add("0_7", ['海口市', '三亚市', '省直辖县级行政单位']);
dsy.add("0_7_0", ['秀英区', '龙华区', '琼山区', '美兰区' ]);
dsy.add("0_7_0", ['河西区', '河东区', '海棠湾镇', '田独镇', '凤凰镇', '天涯镇', '岸城镇', '育才镇' ]);
dsy.add("0_7_0", ['万宁市', '东方市', '中沙群岛的岛礁及其海域', '临高县', '乐东黎族自治县', '五指山市', '保亭黎族苗族自治县', '儋州市', '南沙群岛', '定安县', '屯昌县', '文昌市', '昌江黎族自治县', '澄迈县', '琼中黎族苗族自治县', '琼海市', '白沙黎族自治县', '西沙群岛', '陵水黎族自治县' ]);


//"河北"
dsy.add("0_8", ['保定市', '唐山市', '廊坊市', '张家口市', '承德市', '沧州市', '石家庄市', '秦皇岛市', '衡水市', '邢台市', '邯郸市']);
dsy.add("0_8_0", ['博野县', '唐县', '安国市', '安新县', '定兴县', '定州市', '容城县', '市辖区', '徐水县', '易县', '曲阳县', '望都县', '涞水县', '涞源县', '涿州市', '清苑县', '满城县', '蠡县', '阜平县', '雄县', '顺平县', '高碑店市', '高阳县' ]);
dsy.add("0_8_1", ['乐亭县', '唐海县', '市辖区', '滦南县', '滦县', '玉田县', '迁安市', '迁西县', '遵化市' ]);
dsy.add("0_8_2", ['三河市', '固安县', '大厂回族自治县', '大城县', '市辖区', '文安县', '永清县', '霸州市', '香河县' ]);
dsy.add("0_8_3", ['万全县', '宣化县', '尚义县', '崇礼县', '市辖区', '康保县', '张北县', '怀安县', '怀来县', '沽源县', '涿鹿县', '蔚县', '赤城县', '阳原县' ]);
dsy.add("0_8_4", ['丰宁满族自治县', '兴隆县', '围场满族蒙古族自治县', '宽城满族自治县', '市辖区', '平泉县', '承德县', '滦平县', '隆化县' ]);
dsy.add("0_8_5", ['东光县', '任丘市', '南皮县', '吴桥县', '孟村回族自治县', '市辖区', '沧县', '河间市', '泊头市', '海兴县', '献县', '盐山县', '肃宁县', '青县', '黄骅市' ]);
dsy.add("0_8_6", ['井陉县', '元氏县', '市辖区', '平山县', '新乐市', '无极县', '晋州市', '栾城县', '正定县', '深泽县', '灵寿县', '藁城市', '行唐县', '赞皇县', '赵县', '辛集市', '高邑县', '鹿泉市' ]);
dsy.add("0_8_7", ['卢龙县', '市辖区', '抚宁县', '昌黎县', '青龙满族自治县' ]);
dsy.add("0_8_8", ['冀州市', '安平县', '市辖区', '故城县', '景县', '枣强县', '武强县', '武邑县', '深州市', '阜城县', '饶阳县' ]);
dsy.add("0_8_9", ['临城县', '临西县', '任县', '内丘县', '南和县', '南宫市', '威县', '宁晋县', '巨鹿县', '市辖区', '平乡县', '广宗县', '新河县', '柏乡县', '沙河市', '清河县', '邢台县', '隆尧县' ]);
dsy.add("0_8_10", ['临漳县', '大名县', '市辖区', '广平县', '成安县', '曲周县', '武安市', '永年县', '涉县', '磁县', '肥乡县', '邯郸县', '邱县', '馆陶县', '魏县', '鸡泽县' ]);

//"河南",
dsy.add("0_9", ['三门峡市', '信阳市', '南阳市', '周口市', '商丘市', '安阳市', '平顶山市', '开封市', '新乡市', '洛阳市', '漯河市', '濮阳市', '焦作市', '许昌市', '郑州市', '驻马店市', '鹤壁市']);
dsy.add("0_9_0", ['义马市', '卢氏县', '市辖区', '渑池县', '灵宝市', '陕县' ]);
dsy.add("0_9_1", ['光山县', '商城县', '固始县', '市辖区', '息县', '新县', '淮滨县', '潢川县', '罗山县' ]);
dsy.add("0_9_2", ['内乡县', '南召县', '唐河县', '市辖区', '新野县', '方城县', '桐柏县', '淅川县', '社旗县', '西峡县', '邓州市', '镇平县' ]);
dsy.add("0_9_3", ['商水县', '太康县', '市辖区', '扶沟县', '沈丘县', '淮阳县', '西华县', '郸城县', '项城市', '鹿邑县' ]);
dsy.add("0_9_4", ['夏邑县', '宁陵县', '市辖区', '柘城县', '民权县', '永城市', '睢县', '虞城县' ]);
dsy.add("0_9_5", ['内黄县', '安阳县', '市辖区', '林州市', '汤阴县', '滑县' ]);
dsy.add("0_9_6", ['叶县', '宝丰县', '市辖区', '汝州市', '舞钢市', '郏县', '鲁山县' ]);
dsy.add("0_9_7", ['兰考县', '尉氏县', '市辖区', '开封县', '杞县', '通许县' ]);
dsy.add("0_9_8", ['卫辉市', '原阳县', '封丘县', '市辖区', '延津县', '新乡县', '获嘉县', '辉县市', '长垣县' ]);
dsy.add("0_9_9", ['伊川县', '偃师市', '孟津县', '宜阳县', '嵩县', '市辖区', '新安县', '栾川县', '汝阳县', '洛宁县' ]);
dsy.add("0_9_10", ['临颍县', '市辖区', '舞阳县' ]);
dsy.add("0_9_11", ['南乐县', '台前县', '市辖区', '清丰县', '濮阳县', '范县' ]);
dsy.add("0_9_12", ['修武县', '博爱县', '孟州市', '市辖区', '武陟县', '沁阳市', '济源市', '温县' ]);
dsy.add("0_9_13", ['市辖区', '禹州市', '襄城县', '许昌县', '鄢陵县', '长葛市' ]);
dsy.add("0_9_14", ['中牟县', '巩义市', '市辖区', '新密市', '新郑市', '登封市', '荥阳市' ]);
dsy.add("0_9_15", ['上蔡县', '市辖区', '平舆县', '新蔡县', '正阳县', '汝南县', '泌阳县', '确山县', '西平县', '遂平县' ]);
dsy.add("0_9_16", ['市辖区', '浚县', '淇县' ]);

//"黑龙江"
dsy.add("0_10", ['七台河市', '伊春市', '佳木斯市', '双鸭山市', '哈尔滨市', '大兴安岭地区', '大庆市', '牡丹江市', '绥化市', '鸡西市', '鹤岗市', '黑河市', '齐齐哈尔市']);
dsy.add("0_10_0", ['勃利县', '市辖区' ]);
dsy.add("0_10_1", ['嘉荫县', '市辖区', '铁力市' ]);
dsy.add("0_10_2", ['同江市', '富锦市', '市辖区', '抚远县', '桦南县', '桦川县', '汤原县' ]);
dsy.add("0_10_3", ['友谊县', '宝清县', '市辖区', '集贤县', '饶河县' ]);
dsy.add("0_10_4", ['五常市', '依兰县', '双城市', '宾县', '尚志市', '巴彦县', '市辖区', '延寿县', '方正县', '木兰县', '通河县' ]);
dsy.add("0_10_5", ['加格达奇区', '呼中区', '呼玛县', '塔河县', '新林区', '松岭区', '漠河县' ]);
dsy.add("0_10_6", ['市辖区', '杜尔伯特蒙古族自治县', '林甸县', '肇州县', '肇源县' ]);
dsy.add("0_10_7", ['东宁县', '宁安市', '市辖区', '林口县', '海林市', '穆棱市', '绥芬河市' ]);
dsy.add("0_10_8", ['兰西县', '安达市', '市辖区', '庆安县', '明水县', '望奎县', '海伦市', '绥棱县', '肇东市', '青冈县' ]);
dsy.add("0_10_9", ['密山市', '市辖区', '虎林市', '鸡东县' ]);
dsy.add("0_10_10", ['市辖区', '绥滨县', '萝北县' ]);
dsy.add("0_10_11", ['五大连池市', '北安市', '嫩江县', '孙吴县', '市辖区', '逊克县' ]);
dsy.add("0_10_12", ['依安县', '克东县', '克山县', '富裕县', '市辖区', '拜泉县', '泰来县', '甘南县', '讷河市', '龙江县' ]);

//"湖北"
dsy.add("0_11", ['十堰市', '咸宁市', '孝感市', '宜昌市', '恩施土家族苗族自治州', '武汉市', '省直辖县级行政单位', '荆州市', '荆门市', '襄樊市', '鄂州市', '随州市', '黄冈市', '黄石市']);
dsy.add("0_11_0", ['丹江口市', '市辖区', '房县', '竹山县', '竹溪县', '郧县', '郧西县' ]);
dsy.add("0_11_1", ['嘉鱼县', '崇阳县', '市辖区', '赤壁市', '通城县', '通山县' ]);
dsy.add("0_11_2", ['云梦县', '大悟县', '孝昌县', '安陆市', '市辖区', '应城市', '汉川市' ]);
dsy.add("0_11_3", ['五峰土家族自治县', '兴山县', '宜都市', '市辖区', '当阳市', '枝江市', '秭归县', '远安县', '长阳土家族自治县' ]);
dsy.add("0_11_4", ['利川市', '咸丰县', '宣恩县', '巴东县', '建始县', '恩施市', '来凤县', '鹤峰县' ]);
dsy.add("0_11_5", ['市辖区' ]);
dsy.add("0_11_6", ['仙桃市', '天门市', '潜江市', '神农架林区' ]);
dsy.add("0_11_7", ['公安县', '市辖区', '松滋市', '江陵县', '洪湖市', '监利县', '石首市' ]);
dsy.add("0_11_8", ['京山县', '市辖区', '沙洋县', '钟祥市' ]);
dsy.add("0_11_9", ['保康县', '南漳县', '宜城市', '市辖区', '枣阳市', '老河口市', '谷城县' ]);
dsy.add("0_11_10", ['市辖区' ]);
dsy.add("0_11_11", ['市辖区', '广水市' ]);
dsy.add("0_11_12", ['团风县', '市辖区', '武穴市', '浠水县', '红安县', '罗田县', '英山县', '蕲春县', '麻城市', '黄梅县' ]);
dsy.add("0_11_13", ['大冶市', '市辖区', '阳新县' ]);

//"湖南"
dsy.add("0_12", ['娄底市', '岳阳市', '常德市', '张家界市', '怀化市', '株洲市', '永州市', '湘潭市', '湘西土家族苗族自治州', '益阳市', '衡阳市', '邵阳市', '郴州市', '长沙市']);
dsy.add("0_12_0", ['冷水江市', '双峰县', '市辖区', '新化县', '涟源市' ]);
dsy.add("0_12_1", ['临湘市', '华容县', '岳阳县', '市辖区', '平江县', '汨罗市', '湘阴县' ]);
dsy.add("0_12_2", ['临澧县', '安乡县', '市辖区', '桃源县', '汉寿县', '津市市', '澧县', '石门县' ]);
dsy.add("0_12_3", ['市辖区', '慈利县', '桑植县' ]);
dsy.add("0_12_4", ['中方县', '会同县', '市辖区', '新晃侗族自治县', '沅陵县', '洪江市', '溆浦县', '芷江侗族自治县', '辰溪县', '通道侗族自治县', '靖州苗族侗族自治县', '麻阳苗族自治县' ]);
dsy.add("0_12_5", ['市辖区', '攸县', '株洲县', '炎陵县', '茶陵县', '醴陵市' ]);
dsy.add("0_12_6", ['东安县', '双牌县', '宁远县', '市辖区', '新田县', '江华瑶族自治县', '江永县', '祁阳县', '蓝山县', '道县' ]);
dsy.add("0_12_7", ['市辖区', '湘乡市', '湘潭县', '韶山市' ]);
dsy.add("0_12_8", ['保靖县', '凤凰县', '古丈县', '吉首市', '永顺县', '泸溪县', '花垣县', '龙山县' ]);
dsy.add("0_12_9", ['南县', '安化县', '市辖区', '桃江县', '沅江市' ]);
dsy.add("0_12_10", ['市辖区', '常宁市', '祁东县', '耒阳市', '衡东县', '衡南县', '衡山县', '衡阳县' ]);
dsy.add("0_12_11", ['城步苗族自治县', '市辖区', '新宁县', '新邵县', '武冈市', '洞口县', '绥宁县', '邵东县', '邵阳县', '隆回县' ]);
dsy.add("0_12_12", ['临武县', '嘉禾县', '安仁县', '宜章县', '市辖区', '桂东县', '桂阳县', '永兴县', '汝城县', '资兴市' ]);
dsy.add("0_12_13", ['宁乡县', '市辖区', '望城县', '浏阳市', '长沙县' ]);

//"吉林"
dsy.add("0_13", ['吉林市', '四平市', '延边朝鲜族自治州', '松原市', '白城市', '白山市', '辽源市', '通化市', '长春市']);
dsy.add("0_13_0", ['市辖区', '昌邑区', '龙潭区', '船营区', '丰满区', '桦甸市', '永吉县', '磐石市', '舒兰市', '蛟河市' ]);
dsy.add("0_13_1", ['市辖区', '伊通满族自治县', '公主岭市', '双辽市', '梨树县' ]);
dsy.add("0_13_2", ['和龙市', '图们市', '安图县', '延吉市', '敦化市', '汪清县', '珲春市', '龙井市' ]);
dsy.add("0_13_3", ['市辖区', '乾安县', '前郭尔罗斯蒙古族自治县', '扶余县', '长岭县']);
dsy.add("0_13_4", ['市辖区', '大安市', '洮南市', '通榆县', '镇赉县' ]);
dsy.add("0_13_5", ['市辖区', '临江市', '抚松县', '长白朝鲜族自治县', '靖宇县' ]);
dsy.add("0_13_6", ['市辖区', '东丰县', '东辽县' ]);
dsy.add("0_13_7", ['市辖区', '柳河县', '梅河口市', '辉南县', '通化县', '集安市' ]);
dsy.add("0_13_8", ['市辖区', '九台市', '农安县', '德惠市', '榆树市']);

//"江苏",
dsy.add("0_14", ['南京市', '南通市', '宿迁市', '常州市', '徐州市', '扬州市', '无锡市', '泰州市', '淮安市', '盐城市', '苏州市', '连云港市', '镇江市']);
dsy.add("0_14_0", ['市辖区', '溧水县', '高淳县' ]);
dsy.add("0_14_1", ['启东市', '如东县', '如皋市', '市辖区', '海安县', '海门市', '通州市']);
dsy.add("0_14_2", ['市辖区', '沭阳县', '泗洪县', '泗阳县' ]);
dsy.add("0_14_3", ['市辖区', '溧阳市', '金坛市' ]);
dsy.add("0_14_4", ['丰县', '市辖区', '新沂市', '沛县', '睢宁县', '邳州市', '铜山县' ]);
dsy.add("0_14_5", ['仪征市', '宝应县', '市辖区', '江都市', '高邮市' ]);
dsy.add("0_14_6", ['宜兴市', '市辖区', '江阴市' ]);
dsy.add("0_14_7", ['兴化市', '姜堰市', '市辖区', '泰兴市', '靖江市' ]);
dsy.add("0_14_8", ['市辖区', '洪泽县', '涟水县', '盱眙县', '金湖县' ]);
dsy.add("0_14_9", ['东台市', '响水县', '大丰市', '射阳县', '市辖区', '建湖县', '滨海县', '阜宁县']);
dsy.add("0_14_10", ['吴江市', '太仓市', '市辖区', '常熟市', '张家港市', '昆山市' ]);
dsy.add("0_14_11", ['东海县', '市辖区', '灌云县', '灌南县', '赣榆县' ]);
dsy.add("0_14_12", ['丹阳市', '句容市', '市辖区', '扬中市' ]);

//"江西",
dsy.add("0_15", ['上饶市', '九江市', '南昌市', '吉安市', '宜春市', '抚州市', '新余市', '景德镇市', '萍乡市', '赣州市', '鹰潭市' ]);
dsy.add("0_15_0", ['万年县', '上饶县', '余干县', '婺源县', '市辖区', '广丰县', '弋阳县', '德兴市', '横峰县', '玉山县', '鄱阳县', '铅山县' ]);
dsy.add("0_15_1", ['九江县', '修水县', '市辖区', '彭泽县', '德安县', '星子县', '武宁县', '永修县', '湖口县', '瑞昌市', '都昌县' ]);
dsy.add("0_15_2", ['南昌县', '安义县', '市辖区', '新建县', '进贤县' ]);
dsy.add("0_15_3", ['万安县', '井冈山市', '吉安县', '吉水县', '安福县', '峡江县', '市辖区', '新干县', '永丰县', '永新县', '泰和县', '遂川县' ]);
dsy.add("0_15_4", ['万载县', '上高县', '丰城市', '奉新县', '宜丰县', '市辖区', '樟树市', '铜鼓县', '靖安县', '高安市' ]);
dsy.add("0_15_5", ['东乡县', '乐安县', '南丰县', '南城县', '宜黄县', '崇仁县', '市辖区', '广昌县', '资溪县', '金溪县', '黎川县' ]);
dsy.add("0_15_6", ['分宜县', '市辖区' ]);
dsy.add("0_15_7", ['乐平市', '市辖区', '浮梁县' ]);
dsy.add("0_15_8", ['上栗县', '市辖区', '芦溪县', '莲花县' ]);
dsy.add("0_15_9", ['上犹县', '于都县', '会昌县', '信丰县', '全南县', '兴国县', '南康市', '大余县', '宁都县', '安远县', '定南县', '寻乌县', '崇义县', '市辖区', '瑞金市', '石城县', '赣县', '龙南县' ]);
dsy.add("0_15_10", ['余江县', '市辖区', '贵溪市' ]);

//"辽宁",
dsy.add("0_16", ['丹东市', '大连市', '抚顺市', '朝阳市', '本溪市', '沈阳市', '盘锦市', '营口市', '葫芦岛市', '辽阳市', '铁岭市', '锦州市', '阜新市', '鞍山市']);
dsy.add("0_16_0", ['东港市', '凤城市', '宽甸满族自治县', '市辖区' ]);
dsy.add("0_16_1", ['市辖区', '庄河市', '普兰店市', '瓦房店市', '长海县' ]);
dsy.add("0_16_2", ['市辖区', '抚顺县', '新宾满族自治县', '清原满族自治县' ]);
dsy.add("0_16_3", ['凌源市', '北票市', '喀喇沁左翼蒙古族自治县', '市辖区', '建平县', '朝阳县' ]);
dsy.add("0_16_4", ['市辖区', '本溪满族自治县', '桓仁满族自治县' ]);
dsy.add("0_16_5", ['市辖区', '康平县', '新民市', '法库县', '辽中县' ]);
dsy.add("0_16_6", ['大洼县', '市辖区', '盘山县' ]);
dsy.add("0_16_7", ['大石桥市', '市辖区', '盖州市' ]);
dsy.add("0_16_8", ['兴城市', '市辖区', '建昌县', '绥中县' ]);
dsy.add("0_16_9", ['市辖区', '灯塔市', '辽阳县' ]);
dsy.add("0_16_10", ['市辖区', '开原市', '昌图县', '西丰县', '调兵山市', '铁岭县' ]);
dsy.add("0_16_11", ['义县', '凌海市', '北镇市', '市辖区', '黑山县']);
dsy.add("0_16_12", ['市辖区', '彰武县', '阜新蒙古族自治县']);
dsy.add("0_16_13", ['台安县', '岫岩满族自治县', '市辖区', '海城市']);

//"内蒙古",
dsy.add("0_17", ['乌兰察布市', '乌海市', '兴安盟', '包头市', '呼伦贝尔市', '呼和浩特市', '巴彦淖尔市', '赤峰市', '通辽市', '鄂尔多斯市', '锡林郭勒盟', '阿拉善盟']);
dsy.add("0_17_0", ['丰镇市', '市辖区', '集宁区', '兴和县', '凉城县', '化德县', '卓资县', '商都县', '四子王旗', '察哈尔右翼中旗', '察哈尔右翼前旗', '察哈尔右翼后旗' ]);
dsy.add("0_17_1", ['市辖区', '海勃湾区', '海南区', '乌达区' ]);
dsy.add("0_17_2", ['乌兰浩特市', '扎赉特旗', '科尔沁右翼中旗', '科尔沁右翼前旗', '突泉县', '阿尔山市' ]);
dsy.add("0_17_3", ['市辖区', '东河区', '青山区', '石拐区', '九原区', '昆都伦区', '白云矿区', '固阳县', '土默特右旗', '达尔罕茂明安联合旗' ]);
dsy.add("0_17_4", ['市辖区', '扎兰屯市', '海拉尔区', '新巴尔虎右旗', '新巴尔虎左旗', '根河市', '满洲里市', '牙克石市', '莫力达瓦达斡尔族自治旗', '鄂伦春自治旗', '鄂温克族自治旗', '阿荣旗', '陈巴尔虎旗', '额尔古纳市' ]);
dsy.add("0_17_5", ['市辖区', '新城区', '回民区', '玉泉区', '赛罕区', '武川县', '清水河县', '托克托县', '和林格尔县', '土默特左旗' ]);
dsy.add("0_17_6", ['乌拉特中旗', '乌拉特前旗', '乌拉特后旗', '五原县', '市辖区', '临河区', '杭锦后旗', '磴口县' ]);
dsy.add("0_17_7", ['市辖区', '红山区', '元宝山区', '松山区', '克什克腾旗', '喀喇沁旗', '宁城县', '巴林右旗', '巴林左旗', '敖汉旗', '林西县', '翁牛特旗', '阿鲁科尔沁旗' ]);
dsy.add("0_17_8", ['市辖区', '奈曼旗', '科尔沁区', '库伦旗', '开鲁县', '扎鲁特旗', '科尔沁左翼中旗', '科尔沁左翼后旗', '霍林郭勒市' ]);
dsy.add("0_17_9", ['市辖区', '乌审旗', '伊金霍洛旗', '准格尔旗', '东胜区', '杭锦旗', '达拉特旗', '鄂托克前旗', '鄂托克旗' ]);
dsy.add("0_17_10", ['东乌珠穆沁旗', '二连浩特市', '多伦县', '太仆寺旗', '正蓝旗', '正镶白旗', '苏尼特右旗', '苏尼特左旗', '西乌珠穆沁旗', '锡林浩特市', '镶黄旗', '阿巴嘎旗' ]);
dsy.add("0_17_11", ['阿拉善右旗', '阿拉善左旗', '额济纳旗' ]);

//"宁夏",
dsy.add("0_18", ['中卫市', '吴忠市', '固原市', '石嘴山市', '银川市']);
dsy.add("0_18_0", ['中宁县', '市辖区', '海原县' ]);
dsy.add("0_18_1", ['同心县', '市辖区', '盐池县', '青铜峡市' ]);
dsy.add("0_18_2", ['市辖区', '彭阳县', '泾源县', '西吉县', '隆德县' ]);
dsy.add("0_18_3", ['市辖区', '平罗县' ]);
dsy.add("0_18_4", ['市辖区', '永宁县', '灵武市', '贺兰县' ]);

//"青海",
dsy.add("0_19", ['果洛藏族自治州', '海东地区', '海北藏族自治州', '海南藏族自治州', '海西蒙古族藏族自治州', '玉树藏族自治州', '西宁市', '黄南藏族自治州']);
dsy.add("0_19_0", ['久治县', '玛多县', '玛沁县', '班玛县', '甘德县', '达日县' ]);
dsy.add("0_19_1", ['乐都县', '互助土族自治县', '化隆回族自治县', '平安县', '循化撒拉族自治县', '民和回族土族自治县' ]);
dsy.add("0_19_2", ['刚察县', '海晏县', '祁连县', '门源回族自治县' ]);
dsy.add("0_19_3", ['共和县', '兴海县', '同德县', '贵南县', '贵德县' ]);
dsy.add("0_19_4", ['乌兰县', '天峻县', '德令哈市', '格尔木市', '都兰县' ]);
dsy.add("0_19_5", ['囊谦县', '曲麻莱县', '杂多县', '治多县', '玉树县', '称多县' ]);
dsy.add("0_19_6", ['大通回族土族自治县', '市辖区', '湟中县', '湟源县' ]);
dsy.add("0_19_7", ['同仁县', '尖扎县', '河南蒙古族自治县', '泽库县' ]);

//"山东",
dsy.add("0_20", ['东营市', '临沂市', '威海市', '德州市', '日照市', '枣庄市', '泰安市', '济南市', '济宁市', '淄博市', '滨州市', '潍坊市', '烟台市', '聊城市', '莱芜市', '菏泽市', '青岛市']);
dsy.add("0_20_0", ['利津县', '垦利县', '市辖区', '广饶县' ]);
dsy.add("0_20_1", ['临沭县', '市辖区', '平邑县', '沂南县', '沂水县', '苍山县', '莒南县', '蒙阴县', '费县', '郯城县' ]);
dsy.add("0_20_2", ['乳山市', '市辖区', '文登市', '荣成市' ]);
dsy.add("0_20_3", ['临邑县', '乐陵市', '夏津县', '宁津县', '市辖区', '平原县', '庆云县', '武城县', '禹城市', '陵县', '齐河县']);
dsy.add("0_20_4", ['五莲县', '市辖区', '莒县' ]);
dsy.add("0_20_5", ['市辖区', '滕州市' ]);
dsy.add("0_20_6", ['东平县', '宁阳县', '市辖区', '新泰市', '肥城市']);
dsy.add("0_20_7", ['商河县', '市辖区', '平阴县', '济阳县', '章丘市' ]);
dsy.add("0_20_8", ['兖州市', '嘉祥县', '市辖区', '微山县', '曲阜市', '梁山县', '汶上县', '泗水县', '邹城市', '金乡县', '鱼台县']);
dsy.add("0_20_9", ['市辖区', '桓台县', '沂源县', '高青县' ]);
dsy.add("0_20_10", ['博兴县', '市辖区', '惠民县', '无棣县', '沾化县', '邹平县', '阳信县' ]);
dsy.add("0_20_11", ['临朐县', '安丘市', '寿光市', '市辖区', '昌乐县', '昌邑市', '诸城市', '青州市', '高密市' ]);
dsy.add("0_20_12", ['市辖区', '招远市', '栖霞市', '海阳市', '莱州市', '莱阳市', '蓬莱市', '长岛县', '龙口市' ]);
dsy.add("0_20_13", ['东阿县', '临清市', '冠县', '市辖区', '茌平县', '莘县', '阳谷县', '高唐县' ]);
dsy.add("0_20_14", ['市辖区' ]);
dsy.add("0_20_15", ['东明县', '单县', '定陶县', '巨野县', '市辖区', '成武县', '曹县', '郓城县', '鄄城县' ]);
dsy.add("0_20_16", ['即墨市', '市辖区', '平度市', '胶南市', '胶州市', '莱西市' ]);

//"山西",
dsy.add("0_21", ['临汾市', '吕梁市', '大同市', '太原市', '忻州市', '晋中市', '晋城市', '朔州市', '运城市', '长治市', '阳泉市']);
dsy.add("0_21_0", ['乡宁县', '侯马市', '古县', '吉县', '大宁县', '安泽县', '市辖区', '曲沃县', '永和县', '汾西县', '洪洞县', '浮山县', '翼城县', '蒲县', '襄汾县', '隰县', '霍州市' ]);
dsy.add("0_21_1", ['中阳县', '临县', '交口县', '交城县', '兴县', '孝义市', '岚县', '市辖区', '文水县', '方山县', '柳林县', '汾阳市', '石楼县' ]);
dsy.add("0_21_2", ['大同县', '天镇县', '左云县', '市辖区', '广灵县', '浑源县', '灵丘县', '阳高县' ]);
dsy.add("0_21_3", ['古交市', '娄烦县', '市辖区', '清徐县', '阳曲县' ]);
dsy.add("0_21_4", ['五台县', '五寨县', '代县', '保德县', '偏关县', '原平市', '宁武县', '定襄县', '岢岚县', '市辖区', '河曲县', '神池县', '繁峙县', '静乐县' ]);
dsy.add("0_21_5", ['介休市', '和顺县', '太谷县', '寿阳县', '左权县', '市辖区', '平遥县', '昔阳县', '榆社县', '灵石县', '祁县' ]);
dsy.add("0_21_6", ['市辖区', '沁水县', '泽州县', '阳城县', '陵川县', '高平市' ]);
dsy.add("0_21_7", ['右玉县', '山阴县', '市辖区', '应县', '怀仁县' ]);
dsy.add("0_21_8", ['万荣县', '临猗县', '垣曲县', '夏县', '市辖区', '平陆县', '新绛县', '永济市', '河津市', '稷山县', '绛县', '芮城县', '闻喜县' ]);
dsy.add("0_21_9", ['壶关县', '屯留县', '市辖区', '平顺县', '武乡县', '沁县', '沁源县', '潞城市', '襄垣县', '长子县', '长治县', '黎城县' ]);
dsy.add("0_21_10", ['市辖区', '平定县', '盂县' ]);

//"陕西",
dsy.add("0_22", ['咸阳市', '商洛市', '安康市', '宝鸡市', '延安市', '榆林市', '汉中市', '渭南市', '西安市', '铜川市']);
dsy.add("0_22_0", ['三原县', '乾县', '兴平市', '市辖区', '彬县', '旬邑县', '武功县', '永寿县', '泾阳县', '淳化县', '礼泉县', '长武县' ]);
dsy.add("0_22_1", ['丹凤县', '商南县', '山阳县', '市辖区', '柞水县', '洛南县', '镇安县' ]);
dsy.add("0_22_2", ['宁陕县', '岚皋县', '市辖区', '平利县', '旬阳县', '汉阴县', '白河县', '石泉县', '紫阳县', '镇坪县' ]);
dsy.add("0_22_3", ['凤县', '凤翔县', '千阳县', '太白县', '岐山县', '市辖区', '扶风县', '眉县', '陇县', '麟游县' ]);
dsy.add("0_22_4", ['吴起县', '子长县', '安塞县', '宜川县', '富县', '市辖区', '延川县', '延长县', '志丹县', '洛川县', '甘泉县', '黄陵县', '黄龙县']);
dsy.add("0_22_5", ['佳县', '吴堡县', '子洲县', '定边县', '市辖区', '府谷县', '横山县', '清涧县', '神木县', '米脂县', '绥德县', '靖边县' ]);
dsy.add("0_22_6", ['佛坪县', '勉县', '南郑县', '城固县', '宁强县', '市辖区', '洋县', '留坝县', '略阳县', '西乡县', '镇巴县' ]);
dsy.add("0_22_7", ['华县', '华阴市', '合阳县', '大荔县', '富平县', '市辖区', '潼关县', '澄城县', '白水县', '蒲城县', '韩城市' ]);
dsy.add("0_22_8", ['周至县', '市辖区', '户县', '蓝田县', '高陵县' ]);
dsy.add("0_22_9", ['宜君县', '市辖区' ]);

//"上海",
dsy.add("0_23", ['黄浦区', '南汇区', '卢湾区', '嘉定区', '奉贤区', '宝山区', '徐汇区', '普陀区', '杨浦区', '松江区', '浦东新区', '虹口区', '金山区', '长宁区', '闵行区', '闸北区', '青浦区', '静安区', '嵩明县']);
dsy.add("0_23_0", ['内环以内', '内环中环之间', '中环外环之间' ]);
dsy.add("0_23_1", ['康桥镇', '祝桥镇', '周浦镇', '大团镇', '航头镇', '泥城镇', '新场镇', '书院镇', '宣桥镇', '老港镇', '惠南镇', '芦潮港镇', '六灶镇', '万祥镇', '申港街道', '临港新城' ]);
dsy.add("0_23_2", ['内环以内', '内环中环之间', '中环外环之间' ]);
dsy.add("0_23_3", ['外环以外' ]);
dsy.add("0_23_4", ['外环以外' ]);
dsy.add("0_23_5", ['中以内', '中环外环之间', '外环以外' ]);
dsy.add("0_23_6", ['内环以内', '内环中环之间' ]);
dsy.add("0_23_7", ['内环以内', '内环中环之间', '中环外环之间', '桃浦新村' ]);
dsy.add("0_23_8", ['内环以内', '内环中环之间', '中环外环之间' ]);
dsy.add("0_23_9", ['外环以外' ]);
dsy.add("0_23_10", ['中环以内', '中环外环之间', '外环以外' ]);
dsy.add("0_23_11", ['内环以内', '内环中环之间', '中环外环之间' ]);
dsy.add("0_23_12", ['外环以外' ]);
dsy.add("0_23_13", ['内环以内', '内环中环之间', '中环外环之间' ]);
dsy.add("0_23_14", ['中环以内', '中环外环之间', '外环以外' ]);
dsy.add("0_23_15", ['内环以内', '内环中环之间', '中环外环之间' ]);
dsy.add("0_23_16", ['外环以外' ]);
dsy.add("0_23_17", ['内环以内', '内环中环之间', '中环外环之间' ]);
dsy.add("0_23_18", ['外环以外' ]);

//"四川",
dsy.add("0_24", ['乐山市', '内江市', '凉山彝族自治州', '南充市', '宜宾市', '巴中市', '广元市', '广安市', '德阳市', '成都市', '攀枝花市', '泸州市', '甘孜藏族自治州', '眉山市', '绵阳市', '自贡市', '资阳市', '达州市', '遂宁市', '阿坝藏族羌族自治州', '雅安市']);
dsy.add("0_24_0", ['井研县', '夹江县', '峨眉山市', '峨边彝族自治县', '市辖区', '沐川县', '犍为县', '马边彝族自治县' ]);
dsy.add("0_24_1", ['威远县', '市辖区', '资中县', '隆昌县' ]);
dsy.add("0_24_2", ['会东县', '会理县', '冕宁县', '喜德县', '宁南县', '布拖县', '德昌县', '昭觉县', '普格县', '木里藏族自治县', '甘洛县', '盐源县', '美姑县', '西昌市', '越西县', '金阳县', '雷波县' ]);
dsy.add("0_24_3", ['仪陇县', '南部县', '市辖区', '营山县', '蓬安县', '西充县', '阆中市' ]);
dsy.add("0_24_4", ['兴文县', '南溪县', '宜宾县', '屏山县', '市辖区', '江安县', '珙县', '筠连县', '长宁县', '高县' ]);
dsy.add("0_24_5", ['南江县', '市辖区', '平昌县', '通江县' ]);
dsy.add("0_24_6", ['剑阁县', '市辖区', '旺苍县', '苍溪县', '青川县' ]);
dsy.add("0_24_7", ['华蓥市', '岳池县', '市辖区', '武胜县', '邻水县' ]);
dsy.add("0_24_8", ['中江县', '什邡市', '市辖区', '广汉市', '绵竹市', '罗江县' ]);
dsy.add("0_24_9", ['双流县', '大邑县', '崇州市', '市辖区', '彭州市', '新津县', '蒲江县', '邛崃市', '郫县', '都江堰市', '金堂县' ]);
dsy.add("0_24_10", ['市辖区', '盐边县', '米易县' ]);
dsy.add("0_24_11", ['叙永县', '古蔺县', '合江县', '市辖区', '泸县' ]);
dsy.add("0_24_12", ['丹巴县', '九龙县', '乡城县', '巴塘县', '康定县', '得荣县', '德格县', '新龙县', '泸定县', '炉霍县', '理塘县', '甘孜县', '白玉县', '石渠县', '稻城县', '色达县', '道孚县', '雅江县' ]);
dsy.add("0_24_13", ['丹棱县', '仁寿县', '市辖区', '彭山县', '洪雅县', '青神县' ]);
dsy.add("0_24_14", ['三台县', '北川羌族自治县', '安县', '市辖区', '平武县', '梓潼县', '江油市', '盐亭县' ]);
dsy.add("0_24_15", ['富顺县', '市辖区', '荣县' ]);
dsy.add("0_24_16", ['乐至县', '安岳县', '市辖区', '简阳市' ]);
dsy.add("0_24_17", ['万源市', '大竹县', '宣汉县', '市辖区', '开江县', '渠县', '达县' ]);
dsy.add("0_24_18", ['大英县', '射洪县', '市辖区', '蓬溪县' ]);
dsy.add("0_24_19", ['九寨沟县', '壤塘县', '小金县', '松潘县', '汶川县', '理县', '红原县', '若尔盖县', '茂县', '金川县', '阿坝县', '马尔康县', '黑水县' ]);
dsy.add("0_24_20", ['名山县', '天全县', '宝兴县', '市辖区', '汉源县', '石棉县', '芦山县', '荥经县' ]);

//"天津",
dsy.add("0_25", ['南开区', '和平区', '河东区', '河西区', '河北区', '红桥区', '塘沽区', '汉沽区', '大港区', '东丽区', '西青区', '津南区', '北辰区', '武清县', '宝坻县', '宁河县', '静海县', '蓟县']);
dsy.add("0_25_0", ['南开区', '和平区', '河东区', '河西区', '河北区', '红桥区', '塘沽区', '汉沽区', '大港区', '东丽区', '西青区', '津南区', '北辰区', '武清县', '宝坻县', '宁河县', '静海县', '蓟县']);

//"西藏",
dsy.add("0_26", ['山南地区', '拉萨市', '日喀则地区', '昌都地区', '林芝地区', '那曲地区', '阿里地区']);
dsy.add("0_26_0", ['乃东县', '加查县', '扎囊县', '措美县', '曲松县', '桑日县', '洛扎县', '浪卡子县', '琼结县', '贡嘎县', '错那县', '隆子县' ]);
dsy.add("0_26_1", ['堆龙德庆县', '墨竹工卡县', '尼木县', '市辖区', '当雄县', '曲水县', '林周县', '达孜县' ]);
dsy.add("0_26_2", ['亚东县', '仁布县', '仲巴县', '南木林县', '吉隆县', '定日县', '定结县', '岗巴县', '康马县', '拉孜县', '日喀则市', '昂仁县', '江孜县', '白朗县', '聂拉木县', '萨嘎县', '萨迦县', '谢通门县' ]);
dsy.add("0_26_3", ['丁青县', '八宿县', '察雅县', '左贡县', '昌都县', '江达县', '洛隆县', '类乌齐县', '芒康县', '贡觉县', '边坝县' ]);
dsy.add("0_26_4", ['墨脱县', '察隅县', '工布江达县', '朗县', '林芝县', '波密县', '米林县' ]);
dsy.add("0_26_5", ['嘉黎县', '安多县', '尼玛县', '巴青县', '比如县', '班戈县', '申扎县', '索县', '聂荣县', '那曲县' ]);
dsy.add("0_26_6", ['噶尔县', '措勤县', '改则县', '日土县', '普兰县', '札达县', '革吉县' ]);

//"新疆",
dsy.add("0_27", ['乌鲁木齐市', '伊犁哈萨克自治州', '克孜勒苏柯尔克孜自治州', '克拉玛依市', '博尔塔拉蒙古自治州', '吐鲁番地区', '和田地区', '哈密地区', '喀什地区', '塔城地区', '巴音郭楞蒙古自治州', '昌吉回族自治州', '自治区直辖县级行政单位', '阿克苏地区', '阿勒泰地区']);
dsy.add("0_27_0", ['乌鲁木齐县', '市辖区' ]);
dsy.add("0_27_1", ['伊宁县', '伊宁市', '奎屯市', '察布查尔锡伯自治县', '尼勒克县', '巩留县', '新源县', '昭苏县', '特克斯县', '霍城县' ]);
dsy.add("0_27_2", ['乌恰县', '阿克陶县', '阿合奇县', '阿图什市' ]);
dsy.add("0_27_3", ['市辖区' ]);
dsy.add("0_27_4", ['博乐市', '温泉县', '精河县' ]);
dsy.add("0_27_5", ['吐鲁番市', '托克逊县', '鄯善县' ]);
dsy.add("0_27_6", ['于田县', '和田县', '和田市', '墨玉县', '民丰县', '洛浦县', '皮山县', '策勒县' ]);
dsy.add("0_27_7", ['伊吾县', '哈密市', '巴里坤哈萨克自治县' ]);
dsy.add("0_27_8", ['伽师县', '叶城县', '喀什市', '塔什库尔干塔吉克自治县', '岳普湖县', '巴楚县', '泽普县', '疏勒县', '疏附县', '英吉沙县', '莎车县', '麦盖提县' ]);
dsy.add("0_27_9", ['乌苏市', '和布克赛尔蒙古自治县', '塔城市', '托里县', '沙湾县', '裕民县', '额敏县' ]);
dsy.add("0_27_10", ['且末县', '博湖县', '和硕县', '和静县', '尉犁县', '库尔勒市', '焉耆回族自治县', '若羌县', '轮台县' ]);
dsy.add("0_27_11", ['吉木萨尔县', '呼图壁县', '奇台县', '昌吉市', '木垒哈萨克自治县', '玛纳斯县', '阜康市' ]);
dsy.add("0_27_12", ['五家渠市', '图木舒克市', '石河子市', '阿拉尔市' ]);
dsy.add("0_27_13", ['乌什县', '库车县', '拜城县', '新和县', '柯坪县', '沙雅县', '温宿县', '阿克苏市', '阿瓦提县' ]);
dsy.add("0_27_14", ['吉木乃县', '哈巴河县', '富蕴县', '布尔津县', '福海县', '阿勒泰市', '青河县' ]);

//"云南",
dsy.add("0_28", ['昆明市', '昭通市', '普洱市', '曲靖市', '临沧市', '丽江市', '保山市', '玉溪市', '大理白族自治州', '德宏傣族景颇族自治州', '怒江傈僳族自治州', '文山壮族苗族自治州', '楚雄彝族自治州', '红河哈尼族彝族自治州', '西双版纳傣族自治州', '迪庆藏族自治州']);
dsy.add("0_28_0", ['市辖区', '五华区', '盘龙区', '官渡区', '西山区', '东川区', '呈贡县', '晋宁县', '富民县', '宜良县', '石林彝族自治县', '嵩明县', '禄劝彝族苗族自治县', '寻甸回族彝族自治县', '安宁县' ]);
dsy.add("0_28_1", ['市辖区', '昭阳区', '鲁甸县巧家县', '盐津县大关县', '永善县绥江县', '镇雄县彝良县', '威信县水富县' ]);
dsy.add("0_28_2", ['市辖区', '思茅区', '宁洱哈尼族彝族自治县', '墨江哈尼族自治县', '景东彝族自治县', '景东彝族自治县', '镇沅彝族哈尼族拉祜族自治县', '江城哈尼族彝族自治县', '孟连傣族拉祜族佤族自治县', '澜沧拉祜族自治县', '西盟佤族自治县' ]);
dsy.add("0_28_3", ['市辖区', '麒麟区', '马龙县', '陆良县', '师宗县', '罗平县', '富源县', '会泽县', '沾益县', '宣威市' ]);
dsy.add("0_28_4", ['市辖区', '临翔区', '凤庆县', '云　县', '永德县', '镇康县', '沧源佤族自治县', '耿马傣族佤族自治县', '双江拉祜族佤族布朗族傣族自治县' ]);
dsy.add("0_28_5", ['市辖区', '古城区', '玉龙纳西族自治县', '永胜县', '华坪县', '宁蒗彝族自治县' ]);
dsy.add("0_28_6", ['市辖区', '隆阳区', '施甸县', '腾冲县', '龙陵县', '昌宁县' ]);
dsy.add("0_28_7", ['市辖区', '红塔区', '江川县', '澄江县', '通海县', '华宁县', '易门县', '峨山彝族自治县', '新平彝族傣族自治县', '元江哈尼族彝族傣族自治县' ]);
dsy.add("0_28_8", ['大理市', '祥云县', '宾川县', '弥渡县', '永平县', '云龙县', '洱源县', '剑川县', '鹤庆县', '漾濞彝族自治县', '南涧彝族自治县', '巍山彝族回族自治县']);
dsy.add("0_28_9", ['瑞丽市', '潞西市', '梁河县', '盈江县', '陇川县' ]);
dsy.add("0_28_10", ['泸水县', '福贡县', '贡山独龙族怒族自治县', '兰坪白族普米族自治县' ]);
dsy.add("0_28_11", ['文山县', '砚山县', '西畴县', '麻栗坡县', '马关县', '丘北县', '广南县', '富宁县' ]);
dsy.add("0_28_12", ['楚雄市', '双柏县', '牟定县', '南华县', '姚安县', '大姚县', '永仁县', '元谋县', '武定县', '禄丰县']);
dsy.add("0_28_13", ['个旧市', '开远市', '蒙自县', '建水县', '石屏县', '弥勒县', '泸西县', '元阳县', '红河县', '绿春县', '屏边苗族自治县', '河口瑶族自治县', '金平苗族瑶族傣族自治县' ]);
dsy.add("0_28_14", ['景洪市', '勐海县', '勐腊县' ]);
dsy.add("0_28_15", ['德钦县', '维西傈僳族自治县', '香格里拉县' ]);

//"浙江",
dsy.add("0_29", ['丽水市', '台州市', '嘉兴市', '宁波市', '杭州市', '温州市', '湖州市', '绍兴市', '舟山市', '衢州市', '金华市']);
dsy.add("0_29_0", ['云和县', '市辖区', '庆元县', '景宁畲族自治县', '松阳县', '缙云县', '遂昌县', '青田县', '龙泉市' ]);
dsy.add("0_29_1", ['三门县', '临海市', '仙居县', '天台县', '市辖区', '温岭市', '玉环县' ]);
dsy.add("0_29_2", ['嘉善县', '市辖区', '平湖市', '桐乡市', '海宁市', '海盐县' ]);
dsy.add("0_29_3", ['余姚市', '奉化市', '宁海县', '市辖区', '慈溪市', '象山县' ]);
dsy.add("0_29_4", ['临安市', '富阳市', '市辖区', '建德市', '桐庐县', '淳安县' ]);
dsy.add("0_29_5", ['乐清市', '市辖区', '平阳县', '文成县', '永嘉县', '泰顺县', '洞头县', '瑞安市', '苍南县' ]);
dsy.add("0_29_6", ['安吉县', '市辖区', '德清县', '长兴县' ]);
dsy.add("0_29_7", ['上虞市', '嵊州市', '市辖区', '新昌县', '绍兴县', '诸暨市' ]);
dsy.add("0_29_8", ['岱山县', '嵊泗县', '市辖区' ]);
dsy.add("0_29_9", ['市辖区', '常山县', '开化县', '江山市', '龙游县' ]);
dsy.add("0_29_10", ['东阳市', '义乌市', '兰溪市', '市辖区', '武义县', '永康市', '浦江县', '磐安县' ]);

//"重庆"
dsy.add("0_30", ['县', '市辖区']);
dsy.add("0_30_0", ['丰都县', '云阳县', '垫江县', '城口县', '大足县', '奉节县', '巫山县', '巫溪县', '开县', '彭水苗族土家族自治县', '忠县', '梁平县', '武隆县', '潼南县', '璧山县', '石柱土家族自治县', '秀山土家族苗族自治县', '綦江县', '荣昌县', '酉阳土家族苗族自治县', '铜梁县']);
dsy.add("0_30_1", ['万州区', '万盛区', '九龙坡区', '北碚区', '南岸区', '南川区', '双桥区', '合川区', '大渡口区', '巴南区', '永川区', '江北区', '江津区', '沙坪坝区', '涪陵区', '渝中区', '渝北区', '长寿区', '黔江区']); 